import { z } from "zod";

export const azsLocations = [
  // Махачкала
  "АЗС: г. Махачкала, ул. Акушинского, 94",
  "АЗС: г. Махачкала, ул. Акушинского, 100л/1",
  "АЗС: г. Махачкала, пр. Акушинского, 411",
  "АЗС: г. Махачкала, пр. Имама Шамиля, 3",
  "АЗС: г. Махачкала, пр. Гамидова, 1а/2",
  "АЗС: г. Махачкала, пр. Насрутдинова, 111",
  "АЗС: г. Махачкала, пр. Петра Первого, 24/1",
  "АЗС: г. Махачкала, ул. Хаджи Булача, 10/1",
  "АЗС: г. Махачкала, ул. Каммаева, 7",

  // Дагестанские Огни
  "АЗС: г. Дагестанские Огни, 92",

  // Дербент
  "АЗС: г. Дербент, ул. Новокарьерная, 28",

  // Буйнакск
  "АЗС: г. Буйнакск, ул. Имама Шамиля, 107",

  // Хасавюрт
  "АЗС: г. Хасавюрт, мкр Восточный, ул. Рыбникова, 72А",

  // Избербаш
  "АЗС: г. Избербаш, ул. Буйнакского, 111в",
  "АЗС: г. Избербаш, ул. Чайковского, 3",

  // Каякент
  "АЗС: с. Каякент, ФАД «Кавказ» (зелёная)",
  "АЗС: с. Каякент, ФАД «Кавказ» (красная)",

  // Ботаюрт
  "АЗС: с. Ботаюрт, ул. Шоссейная, 72",

  // Кафыр-Кумух
  "АЗС: с. Кафыр-Кумух",

  // Манас
  "АЗС: дорога «Краснодар-Баку», 841 км",
  "АЗС: дорога «Краснодар-Баку», 842 км",
] as const;

export const ezsLocations = [
  // Махачкала, улица Героев Дагестана, 78
  "ЭЗС: 1/3 (Е13) Центр",
  "ЭЗС: 2/3 (E13) Центр",
  "ЭЗС: 3/3 (E13) Центр",

  // Махачкала, ул. Хаджи Булача, д. 10/1
  "ЭЗС: 10/1 (E13) Степной",
  "ЭЗС: 10/2 (E13) Степной",
  "ЭЗС: 10/3 (Е13) Степной",
  "ЭЗС: 10/4 (Е13) Степной",
  "ЭЗС: 10/5 (Е13) Степной",

  // Махачкала, пр. Имама Шамиля, 3А
  "ЭЗС: 7/1 80кВт 05.Ру",
  "ЭЗС: 7/2 60кВт. 05.Ру",

  // Махачкала, пр. Акушинского, 411
  "ЭЗС: 6/1 (E13) Шива",
  "ЭЗС: 6/2 Шива DC150",

  // Махачкала, Карабудахкентское шоссе
  "ЭЗС: 5 Киргу DC120",

  // Хасавюрт
  "ЭЗС: 21/1 Хас DC150",
  "ЭЗС: 21/2 (E13) Хас",

  // Избербаш
  "ЭЗС: 12/1 Изберг DC150",
  "ЭЗС: 12/2 (E13) Изберг",

  // Кизилюрт
  "ЭЗС: 11/1 Парнас DC150",
  "ЭЗС: 11/2 (E13) Парнас",
] as const;
export const allLocations = [...azsLocations, ...ezsLocations] as const;

type Location = (typeof allLocations)[number];

export const azsForSelect = [...azsLocations] as string[];
export const ezsForSelect = [...ezsLocations] as string[];

export const ReviewSchema = z.object({
  station_type: z.enum(["АЗС", "ЭЗС"] as const, {
    error: "Выберите тип станции",
  }),

  location: z
    .string()
    .min(1, "Пожалуйста, выберите заправочную станцию")
    .refine((val) => allLocations.includes(val as Location), {
      message: "Выбранная станция не существует",
    }),

  fullName: z
    .string()
    .min(3, "ФИО минимум 3 символа")
    .max(100, "ФИО слишком длинное")
    .regex(/^[a-zA-Zа-яА-ЯёЁ\s\-]+$/, "Имя может содержать только буквы"),

  phone: z
    .string()
    .regex(
      /^\+7 \(\d{3}\) \d{3}-\d{2}-\d{2}$/,
      "Неверный формат. Используйте: +7 (XXX) XXX-XX-XX",
    ),

  rating: z
    .number("Пожалуйста, поставьте оценку")
    .min(1, "Пожалуйста, поставьте оценку")
    .max(5),

  review: z
    .string()
    .min(10, "Отзыв минимум 10 символов")
    .max(200, "Отзыв слишком длинный"),

  consent: z.boolean().refine((val) => val === true, {
    message: "Необходимо согласие на обработку данных",
  }),
});

export type ReviewFormData = z.infer<typeof ReviewSchema>;
